gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Traiter les interruptions du bouton 3
  if (buttonInterruptFlags[2]) {
    dmxValues[118] = TRIG_LENGTH; // Canal DMX 119 (trig_hh)
    Serial.println("Bouton 3 - Trig HH déclenché (ISR) - Durée: " + String(TRIG_LENGTH));
    buttonInterruptFlags[2] = false;
  }
}


// Fonction pour gérer l'encodeur KY-040
void handleEncoder() {
  int32_t currentEncoderValue = - encoder.getCount();
  
  // Calculer le preset selon la formule : |valeur_encoder / 2| % 10
  // Utiliser la valeur absolue pour éviter les problèmes avec les grandes valeurs négatives
  int32_t normalizedValue = abs(currentEncoderValue / 2);
  uint8_t newPreset = normalizedValue % MAX_PRESETS;
  
  // Si le preset a changé
  if (newPreset != selectedPreset) {
    selectedPreset = newPreset;
    
    // Charger le preset sélectionné
    loadPreset(selectedPreset);
    
    // Afficher le numéro du preset sur le display avec indicateur
    display.clear();    
    display.showNumberDec(selectedPreset);
    
    // Debug sur le moniteur série
    Serial.print("Preset changé: ");
    Serial.print(selectedPreset);
    Serial.print(" - ");
    Serial.println(presets[selectedPreset].name);
  }
  
  // Gestion du bouton de l'encodeur (toggle filtre)
  bool encoderButtonState = !digitalRead(ENCODER_BUTTON_PIN);
  if (encoderButtonState && !encoderButtonPressed && (millis() - lastEncoderButtonPress > BUTTON_DEBOUNCE)) {
    uint8_t currentFilterState = getParameter("filter_on_off");
    uint8_t newFilterState = (currentFilterState == 0) ? 255 : 0;
    setParameter("filter_on_off", newFilterState);
    
    // Afficher l'état du filtre sur le display
    display.clear();
    if (newFilterState == 255) {
      display.showNumberDec(9999); // Afficher "9999" pour indiquer FILTRE ON
    } else {
      display.showNumberDec(0);    // Afficher "0000" pour indiquer FILTRE OFF
    }
    
    Serial.print("Filtre: ");
    Serial.println((newFilterState == 255) ? "ON" : "OFF");
    
    encoderButtonPressed = true;
    lastEncoderButtonPress = millis();
  }
  
  if (!encoderButtonState) {
    encoderButtonPressed = false;
  }
}

// Fonction pour mettre à jour l'afficheur TM1637
void updateDisplay() {
  if (millis() - lastDisplayUpdate >= DISPLAY_UPDATE_INTERVAL) {
    // Afficher le preset sélectionné avec un indicateur visuel
    // Format: "P-XX" où XX est le numéro du preset
    
    display.showNumberDec(selectedPreset);
    
    lastDisplayUpdate = millis();
  }
}

void setup()
{
  Serial.begin(115200);
  Serial.println("=== Contrôleur Interactif ESP32 ===");
  Serial.println("Initialisation...");
  
  // Désactiver le Bluetooth pour améliorer la stabilité des lectures analogiques
  btStop();
  Serial.println("Bluetooth désactivé pour optimiser les lectures ADC");
  
  // Afficher l'adresse MAC de l'ESP32
  Serial.print("Adresse MAC ESP32: ");
  Serial.println(WiFi.macAddress());
  
  // Initialisation du tableau DMX à 0
  for (int i = 0; i < 512; i++) {
    dmxValues[i] = 0;
  }
  
  // Initialisation des paramètres
  initializeParameters();
  
  // Initialisation des presets
  initializePresets();
  
  // Chargement du preset 1 au démarrage
  loadPreset(1);
  
  // Initialisation de l'interface utilisateur
  initializeUserInterface();
  
  // Configuration ESP-NOW
  WiFi.mode(WIFI_STA);
  
  if (esp_now_init() != ESP_OK) {
    Serial.println("Erreur d'initialisation ESP-NOW");
    return;
  }
  
  esp_now_register_send_cb(OnDataSent);
  esp_now_register_recv_cb(OnDataRecv);
  
  // Configuration du peer
  memcpy(peerInfo.peer_addr, broadcastAddress, 6);
  peerInfo.channel = 0;
  peerInfo.encrypt = false;
  
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {
    Serial.println("Erreur d'ajout du peer");
    return;
  }
  
  Serial.println("ESP-NOW initialisé");
  Serial.println("Fréquence d'émission: " + String(EMISSION_FREQUENCY) + "Hz");
  Serial.println("Capteurs Sharp IR sur GPIO35 et GPIO36");
  Serial.println("Faders sur GPIO32, GPIO33, GPIO34");
  Serial.println("Encodeur KY-040 sur GPIO26, GPIO27, GPIO25");
  Serial.println("Afficheur TM1637 sur GPIO18, GPIO19");
  Serial.println("Boutons push sur GPIO21, GPIO22, GPIO23");
  Serial.println("================================");
}

void sendDMXvalues()
{
  // Envoi des 4 paquets DMX (512 canaux divisés en 4 blocs de 128)
  for (int packetNumber = 0; packetNumber < 4; packetNumber++)
  {
    outgoingDMXPacket.blockNumber = packetNumber;
    
    // Remplir le paquet avec les 128 valeurs correspondantes
    for (int i = 0; i < 128; i++)
    {
      int dmxIndex = (packetNumber * 128) + i;
      if (dmxIndex < 512) {
        outgoingDMXPacket.dmxvalues[i] = dmxValues[dmxIndex];
      } else {
        outgoingDMXPacket.dmxvalues[i] = 0;
      }
    }
    
    // Envoi du paquet via ESP-NOW
    esp_err_t result = esp_now_send(broadcastAddress, (uint8_t *)&outgoingDMXPacket, sizeof(outgoingDMXPacket));
    
    if (result == ESP_OK) {
      //Serial.print(" [OK]");
    } else {
      Serial.print(" [ERREUR]");
    }
  }
  
  // Décrémenter les canaux trig_kick, trig_snare et trig_hh après l'envoi
  if (dmxValues[116] > 0) dmxValues[116]--; // Canal DMX 117 (trig_kick)
  if (dmxValues[117] > 0) dmxValues[117]--; // Canal DMX 118 (trig_snare)
  if (dmxValues[118] > 0) dmxValues[118]--; // Canal DMX 119 (trig_hh)
  
  //Serial.println();
}

void setlights()
{
  // Utilisation de la valeur Sharp IR déjà calculée dans dmxValues
  uint8_t sharpIRValue1 = dmxValues[DMX_CHANNEL_IR_1 - 1]; // -1 car les canaux DMX commencent à 1
  
  // Canal DMX 1 : Mode de contrôle (0 = intensité rouge, 1 = autre mode, etc.)
  dmxValues[0] = 0; // Mode intensité rouge
  
  // Canal DMX 2 : Intensité rouge modulée par les valeurs Ksoloti
  // Utilisation de la division flottante pour un meilleur contrôle
  uint8_t ksoloti_modulation = (uint8_t)((float)ksoloti_val1);
  
  // Modulation finale avec la valeur Sharp IR
  dmxValues[1] = (3* ksoloti_modulation * sharpIRValue1) / 255;
  
  // Debug (optionnel)
  //Serial.print("Sharp IR DMX: "); Serial.print(sharpIRValue1);
  //Serial.print(" | Ksoloti mod: "); Serial.print(ksoloti_modulation);
  //Serial.print(" | DMX2: "); Serial.println(dmxValues[1]);
  
  // Mise à jour du ruban WS2812B avec les canaux DMX 2, 3 et 4 (RGB)
  uint8_t redValue = dmxValues[1];    // Canal DMX 2 (R)
  uint8_t greenValue = dmxValues[2];  // Canal DMX 3 (G) 
  uint8_t blueValue = dmxValues[3];   // Canal DMX 4 (B)
  
  // Appliquer la couleur RGB à tous les LEDs du ruban
  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i] = CRGB(redValue, greenValue, blueValue);
  }
  
